#+title: ob-gptel

[[https://github.com/karthink/gptel/discussions/364][org-babel support · karthink/gptel · Discussion #364 · GitHub]]

I was looking at https://github.com/tyler-dodge/org-assistant and I thought it would be great to have an org babel package. Something like

#+begin_src gptel :model kagi:summarize:agnes :system-message "Summarize this link"
https://blah.com
#+end_src

#+RESULTS:
: GPTel request failed: Keyword argument :model not one of (:callback :buffer :position :context :dry-run :stream :in-place :system)
